app/Controllers/Home.php

  public function index()
  {
    $rtModel = new DataRTModel();
    $rtData = $rtModel
      ->select('provinces.prov_name, cities.city_name, districts.dis_name')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->groupBy('provinces.prov_name, cities.city_name, districts.dis_name')
      ->findAll(); // Fetch all records from the model

    $wargaModel = new WargaModel();
    $wargaData = $wargaModel
      ->select('warga.id_warga')
      ->join('data_rt', 'warga.id_rt = data_rt.id_rt')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->findAll();

    $rtData1 = $rtModel
      ->select('provinces.prov_name, cities.city_name, districts.dis_name')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->findAll(); // Fetch all records from the model

    $countWargaKecamatan = $wargaModel
      ->select('count(warga.id_warga) as warga, districts.dis_name')
      ->join('data_rt', 'warga.id_rt = data_rt.id_rt')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->groupBy('districts.dis_name')
      ->findAll(); // Fetch all records from the model

    $countRtKecamatan =
      $rtModel
      ->select('count(data_rt.id_rt) as rt, districts.dis_name')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->groupBy('districts.dis_name')
      ->findAll(); // Fetch all records from the model
---
SELECT `provinces`.`prov_name`, `cities`.`city_name`, `districts`.`dis_name`
FROM `data_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
GROUP BY `provinces`.`prov_name`, `cities`.`city_name`, `districts`.`dis_name`
SELECT `warga`.`id_warga`
FROM `warga`
JOIN `data_rt` ON `warga`.`id_rt` = `data_rt`.`id_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
SELECT `provinces`.`prov_name`, `cities`.`city_name`, `districts`.`dis_name`
FROM `data_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
SELECT count(warga.id_warga) as warga, `districts`.`dis_name`
FROM `warga`
JOIN `data_rt` ON `warga`.`id_rt` = `data_rt`.`id_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
GROUP BY `districts`.`dis_name`
SELECT count(data_rt.id_rt) as rt, `districts`.`dis_name`
FROM `data_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
GROUP BY `districts`.`dis_name`