app/Controllers/Kelurahan.php

SELECT `data_rt`.*, `provinces`.`prov_name`, `cities`.`city_name`, `districts`.`dis_name`
FROM `data_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
GROUP BY `provinces`.`prov_name`, `cities`.`city_name`, `districts`.`dis_name`
---
  public function index()
  {
    $rtModel = new DataRTModel();
    $rtData = $rtModel
      ->select('data_rt.*, provinces.prov_name, cities.city_name, districts.dis_name')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->groupBy('provinces.prov_name, cities.city_name, districts.dis_name')
      ->findAll(); // Fetch all records from the model

SELECT `data_rt`.*, `provinces`.`prov_name`, `cities`.`city_name`, `districts`.`dis_name`, `subdistricts`.`subdis_name`
FROM `data_rt`
JOIN `provinces` ON `data_rt`.`prov_id` = `provinces`.`prov_id`
JOIN `cities` ON `data_rt`.`city_id` = `cities`.`city_id`
JOIN `districts` ON `data_rt`.`dis_id` = `districts`.`dis_id`
JOIN `subdistricts` ON `data_rt`.`subdis_id` = `subdistricts`.`subdis_id`
WHERE `id_rt` = '4'
 LIMIT 1
---
  public function detail($id)
  {
    //model initialize
    $rtModel = new DataRTModel();
    $rtData = $rtModel
      ->select('data_rt.*, provinces.prov_name, cities.city_name, districts.dis_name, subdistricts.subdis_name')
      ->join('provinces', 'data_rt.prov_id = provinces.prov_id')
      ->join('cities', 'data_rt.city_id = cities.city_id')
      ->join('districts', 'data_rt.dis_id = districts.dis_id')
      ->join(
        'subdistricts',
        'data_rt.subdis_id = subdistricts.subdis_id'
      )
      ->where('id_rt', $id)
      ->first();