app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
  public function process()
  {
    $user = new UsersModel();
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');
    $dataUser = $user->where([
      'username' => $username,
    ])->first();